In [1]:
import pandas as pd

In [15]:
df = pd.read_csv('data/lab5warmupdata.txt', delimiter='\t')

In [3]:
df.head()

  number1  number2
0   0,589  '0,589'
1   0,578  '0,578'
2   7,779  '7,779'
3   0,139  '0,139'
4   1,687  '1,687'

####Exercise 1: Strip the extra comma from the number1 column and convert to integer

In [14]:
df.number1 = df.number1.str.replace(',','').astype(int)

df.head()

TypeError: cannot convert the series to <type 'int'>

In [ ]:
#Bonus: Do it a different way

####Exercise 2: Strip the extra quotation marks from the column2 and convert to integer

In [16]:
df.number2 = df.number2.str[1:-1]

#df.number2 = df.number2.str.replace("'","")
#df.number2 = df.number2.str.replace(",","").astype(int)

In [17]:
df.head()

  number1 number2
0   0,589   0,589
1   0,578   0,578
2   7,779   7,779
3   0,139   0,139
4   1,687   1,687